/*
  ◆jm.SNSG_horse
　競馬ゲームのレースシミュレータ
*/
(function ($) {
	$.fn.extend({

		//◆初期定数
		course : {
				0 : [ 1220, 1400 ],//基準ラップ：[芝,ダート]
				1200 : {
				 200:["NCU","NOS"],  400:["NCU","NOS"],  600:["LCU","NOS"],  800:["LCU","UPS"],
				1000:["NCU","NOS"], 1200:["NCU","NOS"],
				},
		},


		slope : {
		  NOS : 0, UPS : 1, DNS : -1
		},

		grade : {
		  0:20,//新馬、未勝利
		  1:18,//500
		  2:16,//1000
		  3:14,//1600
		  4:11,//G3,OP
		  5:9,//G2
		  6:5,//G1
		  7:10//海外G1
		},


	});
})(jQuery);
